[15] [기초통계] 통계분석, 통계용어
1. 통계 분석 정의
- 특정한 집단이나 불확실한 현상을 대상으로 자료를 수집해 대상 집단에 대한 정보를 구하고,
적절한 통계분석 방법을 이용해 의사 결정을 하는 과정이다.

- 기술통계(descriptive statistic) : 주어진 자료로 부터 어떠한 판단이나 예측과 같은 주관이
섞일수 있는 과정을 배제하여 통계 집단들의 여러 특성을 수량화하여 객관적인 데이터로
나타내는 통계분석 방법론이다.(평균, 표준편차, 중간값, 최빈값, 그래프)

- 추론통계(inference statistics) : 수집된 자료를 이용해 대상 집단(모집단)에 대한 의사결정을
하는 것이다.

- 모수 추정 : 표본집단으로 부터 모집단의 특성인 모수(평균, 분산등)를 분석하여 모집단을
추론한다.

- 가설 검정 (hypothesis test) : 대상집단에 대해 특정한 가설을 설정한 후에 그 가설이 옳은지
그른지에 대한 채택여부를 결정하는 방법론이다.

- 예측(forecasting) : 미래의 불확실성을 해결해 효율적인 의사결정을 하기 위해 수행한다.


(1) 통계관련 용어

1) 통계학의 분류





2) 전수조사와 표본조사

① 전수조사(전체조사)

- 모집단내에 있는 모든 대상을 조사하는 방법

- 전국민을 대상으로하는 인구조사가 대표적인 예

- 전체를 대상으로함으로 모집단의 특성을 정확히 반영할 수 있으나 시간과 비용이 많이 소요되는 단점을 가진다.

- 예) 인구조사


②표본조사(표본조사)

- 모집단에서 추출된 표본을 대상으로 분석을 실시하기 때문에 전수조사의 단점을 개선할 수 있다.

- 모집단의 특성을 반영하는 표본이 추출되지 못하는 경우 수집된 자료가 무용지물이 될 수 있다.

- 예) 투표일 출구 조사, 선거 여론조사, 마케팅 조사, 산업현장의 안전성 검사, 의.생명분야 임상실험등






3) 모집단과 표본

- 모집단(Population)은 통계적 관찰 대상이 되는 개체의 전체집합을 의미하며,
표본(Sample)은 모집단에서 조사대상으로 추출된 부분집합을 뜻한다.



- 모집단으로부터 표본을 추출하는 과정을 표본추출(Sampling)이라고한다.

- 모집단의 특성을 나타내는 모수(Parameter)와 표본의 특성을 나타내는 통계량(Statistic)의 표기 방법
은 다음과 같다.





4) 표본선택, 표본오차

- 표본조사에서는 전체(모집단)에서 표본을 추출해 모집단을 추정한다. 표본은 무작위로 추출한다.

- 모집단에서 복수의 표본을 무작위로 추출하면 모집단의 성질이 표본별로 달라져 표본오차가 생긴다.

- 표본과 실제 모집단 간의 차이를 나타내는 값으로 표본의 수가 커지면 표준오차는 작아지는 특성을 가지고있다.

- 표본 오차를 극복하는 것이 확률론이다.

----> 무작위 표본추출1 (100명)  ----> 흡연율 20%
모집단 성인   ----> 무작위 표본추출2 (100명)  ----> 흡연율 19%
----> 무작위 표본추출3 (100명)  ----> 흡연율 21%

: 표본으로 추출된 흡연율의 차이를 표본오차라 한다.


5) 통계적 추정

- 일반적으로 모집단의 특성을 파악하기 위해서 모집단의 특성을 대표하는 표본을 추출하고,
이러한 표본을 이용하여 모집단의 특성을 나타내는 각종 모수(모평균, 모분산 등) 를
예측하는 방법이 통계적 추정이다. 


① 통계적 추정 방법

구분  점추정                                                     구간 추정
-----  -------------------------------------------------    -------------------------------------------------------------
  방식  모집단의 특성을 하나의 값으로 추정하는방식   모집단의 특성을 적절한 구간을 이용하는 추정하는 방식
특징  모수와 동일할 가능성이 가장 큰 하나의 값을    모수가 속하는 일정 구간(하한값 상한값)으로 추정하기
선택하는 방법으로 가능성은 희박하다.             때문에 일반적으로 많이 사용한다.


② 구간 추정 주요 용어

- 신뢰수준(Confidence Level) : 계산된 구간이 모수를 포함할 확률을 의미하며 통상 90%, 95%, 99% 등으로 표현한다

- 신뢰구간(Confidence Interval) : 신뢰수준하에서 모수를 포함하는 구간으로 (하한값, 상한값)의 형식으로 표현한다

- 표본오차(Sampling Error) : 모집단에서 추출한 표본이 모집단의 특성과 정확히 일치하지 않아서 발생하는
확률의 차이를 의미한다

예) 대통령 후보의 지지율 여론조사에서 어떤 후보의 지지율이 95% 신뢰수준에서 표본 오차 ±3% 범위에서
32.4%로 조사 되었다고 가정한다면 실제 지지율은 29.4%~35.4%  (-3%~+3%) 사이에 나타날 수 있다는 의미이다
여기서 95% 정도는 이 범위의 지지율을 신뢰할 수 있지만 5% 수준에서는 틀릴 수도 있는 의미이다.
→ 신뢰수준 95%, 표본오차 ±3%, 신뢰구간 29.4%-35.4%
  
  - 표본조사는 전수조사가 아니기 때문에 이러한 표본오차는 발생할 수밖에 없다.

- 표본오차를 줄이기 위해서는 정확한 표본추출 과정을 통해서 모집단의 가치를 최대한 반영해야한다.

- 표본의 수를 늘리면 표본오차는 줄어든다.



6) 가설(hypothesis) 설정

- 가설이란 실증적인 증명에 앞서 세우는 잠정적인 진술이며, 나중에 논리적으로 검증될 수 있는 명제로
통계 분석을 통해서 채택 또는 기각될 수 있다.
(명제: 참이나 거짓을 가리기 위해 어떤 논리적 판단의 내용을 언어, 기호, 식 등으로 나타낸 것)

- 검정 통계량 : 가설 검정을 위해 관찰된 표본으로부터 구해진 통계량

① 가설의 유형

- 귀무가설(영가설): '두 변수간에 관계가 없다.' 또는 '차이가 없다.'는 부정적인 가설로 Ho로 표현함.
예) 연령대별로 좋아하는 메뉴는 차이가 없다. 신약 A는 복용해도 효과가 없다.

- 연구가설(대립가설): '두 변수간에 관계가 있다.' 또는 '차이가 있다.', '효과가 있다.'라는 진술로 H1으로 표현함.
예) 연령대별로 좋아하는 메뉴는 차이가 있다. 신약 A는 질병 치료에 효과가 있다.

- 논문에서는 연구가설을 제시하고, 이 가설이 채택 또는 기각 되는지는 귀무가설을 통해서 검정한다.

- 귀무 가설은 대립가설에 비해서 입증이 수월함으로 귀무 가설이 틀렸음을 증명하여 대립가설을 채택한다.


② 오류

- 제1종의 오류(α)는 귀무가설이 참인데도 불구하고 귀무가설을 옳지 않다고 판단하는 경우

- 제2종의 오류(β) : 귀무가설이 참이 아닌데도 귀무가설을 올바르다고 판단하는 경우


③ 유의수준(α)과 유의확률(P-Value)

- 유의수준(α) : 가설 검정 시, 허용 가능한 1종 오류의 최대치로 연구자가 세운 대립가설의 채택 여부를 판단하는 기준

- 유의확률(P-Value) : 관측된 표본의 결과가 귀무가설을 지지하는 정도의 확률로 유의수준과 비교해 대립가설의 채택
혹은 기각 여부를 판단함


④ 유의수준(α , 의미 있는 수준) 결정

- 유의확률이 유의수준보다 작으면 해당 귀무가설을 기각(타파)할 수 있으며, 즉 오차를 무시해도 좋다는 의미이며,
주장하고자 하는 대립가설을 채택할 수 있다. 

- 연구자는 이러한 유의수준(의미가 있는 값)의 임계값(기준값)을 정해야하며 사회과학 분야에서는 α = 0.05 또는
p < 0.05를 기준으로 한다.

- α=0.05라는 의미는 통계치가 모수치를 대표하는 정도에 있어서 오차가 5%이며, 표본통계치의 신뢰도가 95%라는
것을 의미한다. 즉 100번가운데 오류가 5번 이하로 나올 수 있는 확률을 말한다. 

- 일반적으로 유의수준은 0.1, 0.05, 0.01등의 값을 적용하며 특히 생명을 다루는 분야는 오차범위를 최소화하기위해 
α=0.01 또는 p<0.01을 기준으로 99% 신뢰도를 확보하고 1% 오차만 인정하는 임계치를 정하기도한다.
.

예) 귀무 가설(Ho) : '신약A는 A암 치료에 효과가 없다.' 에서 임계값을 α=0.05 수준으로 정한 경우,
가설을 검정한 확률 수준 p값이 0.04가 나왔다면 p값(0.04)이 α(알파, 0.05)보다 작기 때문에
귀무가설은(영가설)은 기각한다.
따라서 신약 A는 A암 치료에 효과가 있을 확률이 높기때문에
대립가설  '신약 A는 A암 치료에 효과가 있다.'를 채택한다.
p > 0.05보다 크다면 오류를 무시할 수 없음으로 귀무가설을 채택한다.

※ '통계적으로 유의하다'는 의미
'통계적으로 유의하다' 라고 하는 것은 확률적으로 볼 때 단순한 우연이라고 생각되지 않을 정도로 의미가
있다는 뜻이다,
반대로 '통계적으로 유의하지 않다' 라고 하는 것은 실험 결과가 단순한 우연일 수도 있다는 뜻이다.
귀무가설을 기각할때, 연구가설이 '통계적으로 유의하다'라고 표현하다.



7) 기각역과 채택역

- 귀무가설을 채택하거나 기각하는 기준을 임계값이라고 한다.

- 임계값을 기준으로 채택되는 범위를 채택역이라고 하며, 기각되는 범위를 기각역이라고한다.

- 검정 통계량의 값이 기각역에 속하면 귀무가설을 기각하게된다.






8) 단측검정과 양측검정

- 검정 통계량의 분포에서 유의수준 α(알파)에 의하여 기각역의 크기가 결정되는데 기각역의
위치는 대립가설(H1)의 형태에 의하여 결정된다.
즉 대립가설의 형태에 따라서 양측검정과 단측검정으로 나누어진다.

① 양측검정(2-sided)은 귀무가설(H0) '등산은 성별에 따라 만족도에 차이가 없다.'와 같은 형식으로
방향성(어느 한쪽이 많고 적음이 없음)이 없는 경우 적용하는 검정 방법이다
따라서 대립가설(H1)은 "등산은 성별에 따라 만족도에 차이가 있다'와 같은 방향성이 없는
가설을 진술할 수 있다

H0: 등산은 성별에 따라 만족도에 차이기 없다 (=남여 만족도가 같다)    
H1: 등산은 성별에 따라 만족도에 차이가 있다 (=남여 만족도가 같지 않다)

- 다음 그림은 검정결과에 따라 나타나는 P값이 두 기각역중 어느 한 곳에 놓으면 귀무가설이 기각되는
두 가지 경우의 예를 보여준다.




② 단측 검정은 어느 한쪽이 많거나 적은 가설인 경우 해당

H0: 1일 생산되는 불량품의 개수는 평균 30개이다.  (모수 μ(모평균) =30)
H1: 1일 생산되는 불량품의 개수는 평균 30개 이하이다 (모수(모평균) μ <30)
1일 생산되는 불량품의 개수는 평균 30개 이상이다 (모수 μ(모평균) >30)

- 다음 그림은 모평균이 가설에 의해 정해지는 특정값(30)보다 작은 경우 좌측검정이라 하며,
모평균이 특정값(30)보다 큰 경우에는 우측검정이라 한다.




- 통계적인 검정의 실례
초등학교 5학년 어린이들의 15년전 키평균 기록은 148.5, 분산은 7.8 식생활 개선으로 성장에 변화가
일어났다고 생각하여, 현대 초등 5학년 어린이 100명을 무작위로 추출하여 평균를 확인하여보니 149.2였다
키의 변화가 있는지를 검정해본다

귀무가설 : 평균키는 148.5

양측검정의 대립가설 : 키에 변화가 생겼다고 주장하고 싶으므로 평균키는 149.2이다.

우측검정의 대립가설 : 평균키는 148.5보다 크다 


연습문제1: 토익학원 학습법 가설검정

A 토익 학원의 토익점수 평균은 623점, 표준편차 90으로 알려져 있다. 이 토익학원은 자신들의 새로운 학습법을
적용하면 평균은 700점이 넘는다고 주장한다. 이를 가설검정한다.

귀무가설: 토익점수 평균은 623점이다
대립가설: 토익점수 평균은 700점 이상이다. (우측검정)

우리는 오른쪽 임계값을 넘는지 확인할 것이다. 이렇게 한쪽만 검증하는 것을 단측 검정이라 부른다.'

Step1. 모집단의 신뢰구간(95%)의 확률변수 값을 구한다.

c1 <- qnorm(0.95, mean = 623,sd=90) #분위수함수
c1
-----------------------------------------------------------
> c1 <- qnorm(0.95, mean = 623,sd=90) #분위수함수
> c1
[1] 771.0368

- 771까지 채택역이며 단측검정이므로 771점이 오른쪽 임계값이다.

- 표본의 평균을 구해 값이 채택역에 있으면 귀무가설은 채택되고 기각역에 있으면 기각된다.

Step2. 표본데이터 읽어오기

sample <- read.csv("./data/15/ex1_sample.csv")
head(sample,3)
sample<- sample[-1]
head(sample,3)

---------------------------------------------
> head(sample,3)
X    point
1 1 547.8331
2 2 615.9035
3 3 651.0697
> sample<- sample[-1]
> head(sample,3)
point
1 547.8331
2 615.9035
3 651.0697

Step3. 모집단의 신뢰구간과 표본의 평균을 비교한다.

c1
mean(sample$point)

------------------------------------------------------------
> c1
[1] 771.0368
> mean(sample$point)
[1] 640.4372

- 표본의 평균이 640.4372로 채택역을 벗어나지 않았기 때문에 귀무가설은 채택된다.
표본평균이 임계값 771.0368 초과일때 귀무가설은 기각된다.

- 이학원의 주장은 일반화 될 수 없다.


연습문제2: 국어 선생님의 학습법 가설검정

A고등학교의 언어영역 평균 점수는 72점으로 알려져 있다. 국어선생님의 새로운 학습법을 적용한 후
국어선생님은 학생들의 언어영역 평균 점수는 72점이 아니라고 주장한다. 이를 가설 검정으로 검증한다.

귀무가설:언어영역 평균점수는 72점이다.
대립가설:언어영역 평균점수는 72점이 아니다. (양측검정)

이를 검정하기 위해서는 임계값 양쪽을 모두 검증해야 한다. 이런 검증을 양측검정이라 한다.

Step1. 모집단 점수를 불러온다.
- 관측치 3000이며 A고등학교 국어점수 이다.

korea <- read.csv("./data/15/ex2_population.csv")
head(korea)
dim(korea)
--------------------------------------------------------------
> head(korea)
X point
1 1    72
2 2    72
3 3    78
4 4    78
5 5    75
6 6    72
> dim(korea)
[1] 3000    2

Step2. 필요없는 첫 번째 열을 삭제합니다.

korea <- korea[-1]
head(korea)
---------------------------------------------------------
> korea <- korea[-1]
> head(korea)
point
1    72
2    72
3    78
4    78
5    75
6    72

Step3. 평균과 표준편차를 알아본다.

mean(korea$point)
sd(korea$point)
--------------------------------------
> mean(korea$point)
[1] 71.985
> sd(korea$point)
[1] 4.071974

Step4. 귀무가설 채택, 기각을 위한 임계값(5%~95%)을 구한다.

c1<- qnorm(c(0.05,0.95),mean=mean(korea$point),sd=sd(korea$point)) #분위수함수
c1
--------------------------------------------------------------------------
> c1
[1] 65.2872 78.6828

- 65.2872~78.6828까지가 귀무가설 채택역이다. 표본의 평균이 이 안에 있다면
귀무가설은 채택되고 이영역을 벗어나면 기각된다.

Step5. 표본의 데이터를 불러온다

sample <- read.csv("./data/12/ex2_sample.csv")
head(sample,3)
sample <- sample[-1]
head(sample,3)

-----------------------------------------------------
> head(sample,3)
X point
1 1    85
2 2    83
3 3    74
> sample <- sample[-1]
> head(sample,3)
point
1    85
2    83
3    74

Step6.  채택역의 값과 표본의 평균을 비교한다.

c1
mean(sample$point)
--------------------------------

> c1
[1] 65.2872 78.6828
> mean(sample$point)
[1] 80.845

- 채택역을 벗어나 있기 때문에 귀무가설은 기각된다.
이학교 국어 선생님의 학습법이 효과가 있다는 것을 통계적으로 증명했으니 일반화 될 수 있다.